system/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points
(
    (3 0.1 0.0)
    (5 0.1 0.0)
);

fields  (age);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
